# Структура квиза с 10 вопросами
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какой океан самый глубокий?',
        'options': ['Тихий', 'Атлантический', 'Индийский', 'Северный Ледовитый'],
        'correct_option': 0
    },
    {
        'question': 'Кто написал "Мастера и Маргариту"?',
        'options': ['Федор Достоевский', 'Александр Пушкин', 'Михаил Булгаков', 'Лев Толстой'],
        'correct_option': 2
    },
    {
        'question': 'Сколько континентов на Земле?',
        'options': ['5', '6', '7', '8'],
        'correct_option': 2
    },
    {
        'question': 'Какой газ является необходимым для дыхания?',
        'options': ['Кислород', 'Азот', 'Двуокись углерода', 'Водород'],
        'correct_option': 0
    },
    {
        'question': 'Какой вид искусства включает в себя танец?',
        'options': ['Музыка', 'Актёрское искусство', 'Художественная литература', 'Театр'],
        'correct_option': 1
    },
    {
        'question': 'Какой элемент имеет знак "H"?',
        'options': ['Гелий', 'Водород', 'Кислород', 'Азот'],
        'correct_option': 1
    },
    {
        'question': 'Какой орган отвечает за кровообращение?',
        'options': ['Сердце', 'Легкие', 'Печень', 'Почки'],
        'correct_option': 0
    },
    {
        'question': 'Какая планета является третьей от Солнца?',
        'options': ['Марс', 'Земля', 'Венера', 'Юпитер'],
        'correct_option': 1
    }
]          
